app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (rating IN ('G','R')) ORDER BY id
---
  def index
    @params = params
    @movies = Movie.rating_in(params[:ratings]).order_by(params[:order])